# . - один любой символ кроме \n
# ? - 0 или 1 вхождение шаблона слева
# + - 1 и более вхождений
# * - 0 и более вхождений или повторений
# \w - любая цифра или буква
# \W - все кроме
# \d - любая цифра
# \D - все кром цифр
# \s - любой "пробельный символ"
# \S - все кроме
# \b - граница слова
# [...] - символы в скобках
# [^...] - любые символы, кроме тех, что в скобках
# \ - экранирование
# ^ $ - начало или конец слова
# {n, m} - от и до вхождений
# a | b - а или b
# () - группы
# \t, \n, \r - символы табуляции, новой строки и возврата

